from random import choice
from .state import State


TEXT_HELLO = 'Привет! Здесь вы можете пройти весёлые тесты.\n' \
             'Назовите категорию, чтобы начать: новое, популярное или случайное.\n' \
             'Также вы можете воспользоваться поиском, сказав название теста.'
TEXT_INTRO = 'Скажите "Дальше", чтобы показать другой, или "Начать", чтобы пройти тест.\n'
TEXT_RESTARTED = 'Вы просмотрели все тесты. Не переживайте, скоро будут новые!\n'
TEXT_NE_PONEL = 'Извините, я вас не понимаю.\n' \
                'Скажите "Помощь" или "Повтори", если не расслышали.'
TEXT_BACK = 'Новое, популярное или случайное?\n' \
            'Если вы хотите выйти, скажите ещё раз.'
TEXT_BYE = 'До свидания!/Пока!/До скорой встречи!'
TEXT_ENTER_THE_NAME = 'Введите ваше имя или имя друга.'
TEXT_NO_NAME = 'Извините, я не расслышала ваше имя, попробуйте ещё раз.\n' \
               'Используйте реальное имя, а не псевдоним.'
TEXT_END_TEST = 'Если хотите пройти заново, назовите имя. Или скажите "Назад".'
TEXT_START = 'Стартуем!/Поехали!/Начинаем!'
TEXT_WANNA_LIKE = 'Если вам понравился тест, скажите "Лайк"!'
TEXT_ALREADY_LIKED = 'Вы уже лайкали этот тест! Введите имя или скажите "Назад".'
TEXT_HAVE_LIKED = 'Спасибо! Введите имя или скажите "Назад".'
TEXT_NOT_FOUND = 'Извините, я не нашла тестов с таким названием.'
TEXT_FOUND_1 = 'Я нашла один тест.\n{}\n{}\n' \
               'Если это он, скажите "Пройти". Если нет, скажите "Назад".'
TEXT_FOUND_SEVERAL = 'Я нашла {} {}. Пролистать - "Дальше", выйти - "Назад", пройти тест - "Пройти".\n{}\n{}'

TEXT_HELP = {
    State.MENU: 'Чтобы найти тест, выберите категорию "Новое", "Популярное" или "Случайное".\n'
                'Если захотите его пройти, скажите "Старт", если нет - "Дальше" или "Выйти".',
    State.PASS_TEST: 'Назовите ваше имя или имя вашего друга. Не используйте псевдонимы.'
}
for choose in State.CHOOSE:
    TEXT_HELP[choose] = 'Заинтересовало? Скажите "Пройти". Если хотите посмотреть ещё, скажите "Дальше"'

TEXT_ABILITY = 'Я даю вам веселые тесты, которые поднимут настроение вам и вашей компании :)'

# TODO: Variations
WORDS_NEW = 'новое/новые/новая/новый/новых'
WORDS_TOP = 'топ/топовые/топовое/топовая/топовый/' \
            'лучший/лучшее/лучшая/популярное/популярные'
WORDS_RND = 'случайное/случайные/случайная/случайный/' \
            'любой/любое/любая/любые/случайно/' \
            'рандом/рандомное/рандомные/рандомная/рандомный'
WORDS_NEXT = 'еще/ещё/дальше/больше/вперед/вперёд/следующая/следующий/' \
             'следующее/далее/не/неа/фу/нет/другой/другое/другая/другие'
WORDS_PASS = 'пройти/начать/старт/играть/давай/начинай/хорошо/сыграем/поиграем/' \
             'го/погнали/да/го/запускай/поехали'
WORDS_LIKE = 'лайк/принят/принято/класс/клёво/хорошо/отлично/классное/' \
             'классный/классная/прикольно/прикольный/прикольная/прикольное/' \
             'хорошее/хороший/хорошая/может/отличное/отличный/отличная/' \
             'нормально/нормальное/нормальный/интересно/интересный/интересная/' \
             'круто/неплохо/да/пойду/понравилась/понравилось/подумаю/вау/' \
             'понравился/сделаю/возьму/заметку/заметка/хайпово/нравится/' \
             'понравится/хочу/люблю/крутой/крутая/крутое/круть/отпад/вау/ого/нифига/' \
             'флекс/хайп/красивая/красивый/красивое/красивые/ну/так/лайки'
WORDS_HELP = 'помощь/помоги/подсказка/подскажи/подскажите/help'
WORDS_ABILITY = 'умеешь/можешь/могёшь/могешь'
WORDS_REPEAT = 'ещё/еще/повтори/повтори-ка/повтор/понял/слышал/услышал/расслышал/прослушал/скажи/а/сказала'
WORDS_EXIT = 'выход/хватит/пока/свидания/стоп/выйти/выключи/останови/остановить/отмена/закончить/' \
             'закончи/отстань/назад/обратно/верни/вернись'

SOUND_HARP = '<speaker audio="alice-music-harp-1.opus">'
SOUND_DRUM_1 = '<speaker audio="alice-music-drums-1.opus">'
SOUND_DRUM_2 = '<speaker audio="alice-music-drums-2.opus">'
SOUND_GONG = '<speaker audio="alice-music-gong-1.opus">'
SOUND_DRUM_LOOP_1 = '<speaker audio="alice-music-drum-loop-1.opus">'

SOUNDS_INTRIGUE = (SOUND_HARP, SOUND_DRUM_1, SOUND_DRUM_2, SOUND_GONG, SOUND_DRUM_LOOP_1)

EMOJI_NEW = '💡'
EMOJI_TOP = '🔥'
EMOJI_RND = '🎲'
EMOJI_HELP = '❓'
EMOJI_ABILITY = '🌐'
EMOJI_PASS = '📝'
EMOJI_BACK = '🏠'
EMOJI_MORE = '➡️'
EMOJI_REPEAT = '👂'
EMOJI_LIKE = '❤'

BUTTONS = {
    State.MENU: (f'{EMOJI_NEW}Новое', f'{EMOJI_TOP}Популярное', f'{EMOJI_RND}Случайное',
                 f'{EMOJI_HELP}Помощь', f'{EMOJI_ABILITY}Что ты умеешь?'),
    State.PASS_TEST: ('Александр/Андрей/Илья/Егор/Даниил/Олег',
                      'Анжела/Настя/Яна/Оля/Лена/Вера/Алина/Аня',
                      f'{EMOJI_BACK}Назад'),
    State.CHOOSE_FOUND: (f'{EMOJI_PASS}Пройти', f'{EMOJI_BACK}Назад', f'{EMOJI_REPEAT}Повтори')
}

BUTTON_LIKE = f'{EMOJI_LIKE}Лайк'


for choose in State.CHOOSE[:-1]:
    BUTTONS[choose] = (f'{EMOJI_PASS}Пройти', f'{EMOJI_MORE}Дальше/{EMOJI_MORE}Ещё/{EMOJI_MORE}Далее',
                       f'{EMOJI_BACK}Назад', f'{EMOJI_REPEAT}Повтори')


def txt(string):
    return choice(string.split('/'))


def tkn(string):
    return tuple(string.split('/'))


def btn(string):
    if isinstance(string, tuple):
        return list(map(lambda x: txt(x), string))
    return txt(string),


def snd(sounds):
    return choice(sounds)

