from random import choice
from .state import State


TEXT_HELLO = 'Привет! Здесь вы можете пройти весёлые тесты.\n' \
             'Назовите категорию, чтобы начать: новое, популярное или случайное.\n' \
             'Или воспользуйтесь поиском, сказав название теста.'
TEXT_INTRO = 'Скажите "Дальше", чтобы показать другой, или "Начать", чтобы пройти тест.\n'
TEXT_RESTARTED = 'Вы просмотрели все тесты. Не переживайте, скоро будут новые!\n'
TEXT_NE_PONEL = 'Извините, я вас не понимаю'
TEXT_BACK = 'Новое, популярное или случайное?\n' \
            'Если вы хотите выйти, скажите ещё раз.'
TEXT_BYE = 'До свидания!/Пока!/До скорой встречи!'
TEXT_ENTER_THE_NAME = 'Введите ваше имя или имя друга.'
TEXT_NO_NAME = 'Извините, я не рассылашала ваше имя, попробуйте ещё раз.\n' \
               'Используйте реальное имя, а не псевдоним.'
TEXT_START = 'Стартуем!/Поехали!/Начинаем!'

# TODO: Variations
WORDS_NEW = 'новое/новые/новая/новый/новых'
WORDS_TOP = 'топ/топовые/топовое/топовая/топовый/' \
            'лучший/лучшее/лучшая/популярное/популярные'
WORDS_RND = 'случайное/случайные/случайная/случайный/' \
            'любой/любое/любая/любые/' \
            'рандом/рандомное/рандомные/рандомная/рандомный'
WORDS_NEXT = 'еще/ещё/дальше/больше/вперед/вперёд/следующая/следующий/' \
             'следующее/далее/не/неа/фу/нет'
WORDS_PASS = 'пройти/начать/старт'
WORDS_EXIT = 'выход/хватит/пока/свидания/стоп/выйти/выключи/останови/остановить/отмена/закончить/' \
             'закончи/отстань/назад/обратно/верни/вернись'

BUTTONS = {
    State.MENU: ('Новое', 'Популярное', 'Случайное', 'Помощь', 'Что ты умеешь?'),
    State.NAME: ('Александр/Андрей/Илья/Егор/Даниил/Роман/Олег',
                 'Анжела/Настя/Яна/Оля/Лена/Вера/Алина/Аня',
                 'Назад')
}
for choose in State.CHOOSE:
    BUTTONS[choose] = ('Дальше/Ещё/Далее', 'Пройти', 'Назад', 'Повтори')


def txt(string):
    return choice(string.split('/'))


def tkn(string):
    return tuple(string.split('/'))


def btn(string):
    if isinstance(string, tuple):
        return list(map(lambda x: txt(x), string))
    return txt(string),
